Ran Plan for dir: `terragrunt/kubernetes/longhorn` workspace: `terragrunt_kubernetes_longhorn`

<details><summary>Show Output</summary>

```diff
Authenticated

01:01:05.454 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/9L0lp5HDy7IAuld4auBn96GWkEQ/N4kRNeARMwWlkLIhJAamwj4IgtY
01:01:05.475 INFO   tofu: Initializing the backend...
01:01:05.762 INFO   tofu: Initializing provider plugins...
01:01:05.762 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:01:06.665 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:01:07.385 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:01:08.147 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:01:08.306 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:01:08.851 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:01:09.467 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:01:09.658 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:01:09.826 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
01:01:09.861 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
01:01:09.898 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
01:01:09.918 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.4.0
01:01:09.955 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
01:01:09.973 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
01:01:10.050 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
01:01:10.070 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
01:01:10.072 INFO   tofu: OpenTofu has been successfully initialized!
01:01:10.705 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:01:10.705 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:01:10.705 STDOUT tofu:   + create
01:01:10.705 STDOUT tofu:   ~ update in-place
01:01:10.705 STDOUT tofu: OpenTofu will perform the following actions:
01:01:10.705 STDOUT tofu:   # helm_release.longhorn will be updated in-place
01:01:10.705 STDOUT tofu:   ~ resource "helm_release" "longhorn" {
01:01:10.705 STDOUT tofu:       ~ id                         = "longhorn" -> (known after apply)
01:01:10.705 STDOUT tofu:       ~ metadata                   = {
01:01:10.705 STDOUT tofu:           ~ app_version    = "v1.9.0" -> (known after apply)
01:01:10.705 STDOUT tofu:           ~ chart          = "longhorn" -> (known after apply)
01:01:10.705 STDOUT tofu:           ~ first_deployed = 1747009042 -> (known after apply)
01:01:10.705 STDOUT tofu:           ~ last_deployed  = 1748435642 -> (known after apply)
01:01:10.705 STDOUT tofu:           ~ name           = "longhorn" -> (known after apply)
01:01:10.705 STDOUT tofu:           ~ namespace      = "longhorn-system" -> (known after apply)
01:01:10.705 STDOUT tofu:           ~ revision       = 3 -> (known after apply)
01:01:10.705 STDOUT tofu:           ~ values         = jsonencode(
01:01:10.705 STDOUT tofu:                 {
01:01:10.705 STDOUT tofu:                   - defaultBackupStore = {
01:01:10.705 STDOUT tofu:                       - backupTarget                 = "s3://longhorn@us-east-1/"
01:01:10.705 STDOUT tofu:                       - backupTargetCredentialSecret = "longhorn-secrets"
01:01:10.705 STDOUT tofu:                     }
01:01:10.705 STDOUT tofu:                   - defaultSettings    = {
01:01:10.705 STDOUT tofu:                       - systemManagedComponentsNodeSelector = "!node-role.kubernetes.io/master"
01:01:10.705 STDOUT tofu:                     }
01:01:10.705 STDOUT tofu:                   - longhornUI         = {
01:01:10.705 STDOUT tofu:                       - replicas = 1
01:01:10.705 STDOUT tofu:                     }
01:01:10.705 STDOUT tofu:                   - persistence        = {
01:01:10.705 STDOUT tofu:                       - defaultClassReplicaCount = 2
01:01:10.705 STDOUT tofu:                     }
01:01:10.705 STDOUT tofu:                 }
01:01:10.705 STDOUT tofu:             ) -> (known after apply)
01:01:10.705 STDOUT tofu:           ~ version        = "1.9.0" -> (known after apply)
01:01:10.705 STDOUT tofu:         } -> (known after apply)
01:01:10.705 STDOUT tofu:         name                       = "longhorn"
01:01:10.705 STDOUT tofu:       ~ version                    = "1.9.0" -> "1.9.1"
01:01:10.705 STDOUT tofu:         # (26 unchanged attributes hidden)
01:01:10.705 STDOUT tofu:     }
01:01:10.705 STDOUT tofu:   # kubectl_manifest.longhorn_daily_backup will be created
01:01:10.705 STDOUT tofu:   + resource "kubectl_manifest" "longhorn_daily_backup" {
01:01:10.706 STDOUT tofu:       + api_version             = "longhorn.io/v1beta1"
01:01:10.706 STDOUT tofu:       + apply_only              = false
01:01:10.706 STDOUT tofu:       + force_conflicts         = false
01:01:10.706 STDOUT tofu:       + force_new               = false
01:01:10.706 STDOUT tofu:       + id                      = (known after apply)
01:01:10.706 STDOUT tofu:       + kind                    = "RecurringJob"
01:01:10.706 STDOUT tofu:       + live_manifest_incluster = (sensitive value)
01:01:10.706 STDOUT tofu:       + live_uid                = (known after apply)
01:01:10.706 STDOUT tofu:       + name                    = "daily-backup"
01:01:10.706 STDOUT tofu:       + namespace               = "longhorn-system"
01:01:10.706 STDOUT tofu:       + server_side_apply       = false
01:01:10.706 STDOUT tofu:       + uid                     = (known after apply)
01:01:10.706 STDOUT tofu:       + validate_schema         = true
01:01:10.706 STDOUT tofu:       + wait_for_rollout        = true
01:01:10.706 STDOUT tofu:       + yaml_body               = (sensitive value)
01:01:10.706 STDOUT tofu:       + yaml_body_parsed        = <<-EOT
01:01:10.706 STDOUT tofu:             apiVersion: longhorn.io/v1beta1
01:01:10.706 STDOUT tofu:             kind: RecurringJob
01:01:10.706 STDOUT tofu:             metadata:
01:01:10.706 STDOUT tofu:               name: daily-backup
01:01:10.706 STDOUT tofu:               namespace: longhorn-system
01:01:10.706 STDOUT tofu:             spec:
01:01:10.706 STDOUT tofu:               concurrency: 1
01:01:10.706 STDOUT tofu:               cron: 0 1 * * *
01:01:10.706 STDOUT tofu:               groups:
01:01:10.706 STDOUT tofu:               - default
01:01:10.706 STDOUT tofu:               retain: 3
01:01:10.706 STDOUT tofu:               task: backup-force-create
01:01:10.706 STDOUT tofu:         EOT
01:01:10.706 STDOUT tofu:       + yaml_incluster          = (sensitive value)
01:01:10.706 STDOUT tofu:     }
01:01:10.706 STDOUT tofu: Plan: 1 to add, 1 to change, 0 to destroy.
01:01:10.706 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/longhorn -w terragrunt_kubernetes_longhorn
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Flonghorn%252Fterragrunt_kubernetes_longhorn)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/longhorn -w terragrunt_kubernetes_longhorn
  ```
Plan: 1 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```